app/controllers/posts_controller.rb

  def show
    @topic = Topic.find_by(id: params[:id])
    @posts = Post.where(topic_id: @topic.id)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  [["topic_id", 35]]

  def create
    @post = Post.new(content: params[:content], topic_id: params[:id])
    @post.save
    @topic = Topic.find_by(id: params[:id])
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?)  [["content", "w"], ["created_at", "2018-07-02 09:34:11.509520"], ["updated_at", "2018-07-02 09:34:11.509520"], ["topic_id", 6]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]