app/controllers/topics_controller.rb

INSERT INTO "topics" ("content", "blue", "red", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "jabsdkasbdkajsd"], ["blue", "asajbdkjabdaksd"], ["red", "aajkdbakdba"], ["created_at", "2018-06-30 12:29:15.236102"], ["updated_at", "2018-06-30 12:29:15.236102"]]
---
def create
  @topic = Topic.new(content: params[:content],blue: params[:blue], red: params[:red])
  @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @topic =Topic.find_by(id: params[:id])